#include <cstdio>
#include <stdio.h>
#include <stdlib.h>
/*
编写程序，实现功能:有n 个整数，使前面各数顺序向后移m个位置，最后m个数变成 最前面m个数。例如:输入10个数1,2,3,4,5,6,7,8,9,10,向后移动4个位置，最后4个数变成最前面 的，数据变为5,6,7,8,9,10,1,2,3,4。
【输入样例】请输入数组的长度(<=100):10
请 输 入 10个 数 : 12345678910
请输入移动的位数:4 
【输出样例】移动后数组: 56789101234
*/
int main(){
    int arr1[100],arr2[100],n,i,j;
    scanf("%d",&n);
    for(i=0;i<n;i++)
        scanf("%d",arr1+i);
    scanf("%d",&j);
    for(i=0;i<n;i++){
        arr2[i]=arr1[j];
        ++j;
        j%=n;
    }
    for(i=0;i<n;i++)
        printf("%d ",arr2[i]);

}